{"pageProps":{"note":{"id":"lx0mkvcis0eemrd9nphbm1p","title":"Volume","desc":"","updated":1699207491327,"created":1658289244461,"custom":{},"fname":"music.engineering.mixing.volume","type":"note","vault":{"fsPath":"../main/thoughts-on","name":"thoughts-on"},"contentHash":"5c093ae4a1fa5de4eec6d09927d5bc22","links":[{"type":"wiki","from":{"fname":"music.engineering.mixing.volume","id":"lx0mkvcis0eemrd9nphbm1p","vaultName":"thoughts-on"},"value":"music.engineering.mixing.compressor","alias":"compressors","position":{"start":{"line":9,"column":3,"offset":964},"end":{"line":9,"column":54,"offset":1015},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"music.engineering.mixing.compressor"}},{"type":"wiki","from":{"fname":"music.engineering.mixing.volume","id":"lx0mkvcis0eemrd9nphbm1p","vaultName":"thoughts-on"},"value":"music.engineering.mixing.compressor","alias":"compression","position":{"start":{"line":20,"column":115,"offset":2240},"end":{"line":20,"column":166,"offset":2291},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"music.engineering.mixing.compressor"}},{"from":{"fname":"music.engineering.mixing","id":"v89y5ry5pbgeazv7v5jr4me","vaultName":"thoughts-on"},"type":"backlink","position":{"start":{"line":70,"column":4,"offset":3281},"end":{"line":70,"column":46,"offset":3323},"indent":[]},"value":"music.engineering.mixing.volume"},{"from":{"fname":"music.engineering.mixing.compressor","id":"enqduojp3hdl58v8o73g2l8","vaultName":"thoughts-on"},"type":"backlink","position":{"start":{"line":3,"column":19,"offset":34},"end":{"line":3,"column":61,"offset":76},"indent":[]},"value":"music.engineering.mixing.volume"},{"from":{"fname":"music.engineering.mixing.compressor","id":"enqduojp3hdl58v8o73g2l8","vaultName":"thoughts-on"},"type":"backlink","position":{"start":{"line":39,"column":14,"offset":3268},"end":{"line":39,"column":91,"offset":3345},"indent":[]},"value":"music.engineering.mixing.volume"},{"from":{"fname":"music.engineering.mixing.compressor","id":"enqduojp3hdl58v8o73g2l8","vaultName":"thoughts-on"},"type":"backlink","position":{"start":{"line":46,"column":10,"offset":3665},"end":{"line":46,"column":70,"offset":3725},"indent":[]},"value":"music.engineering.mixing.volume"},{"from":{"fname":"music.engineering.mixing.compressor","id":"enqduojp3hdl58v8o73g2l8","vaultName":"thoughts-on"},"type":"backlink","position":{"start":{"line":52,"column":10,"offset":4018},"end":{"line":52,"column":70,"offset":4078},"indent":[]},"value":"music.engineering.mixing.volume"}],"anchors":{"volume-as-a-measure-of-depth-control":{"type":"header","text":"Volume as a measure of depth control","value":"volume-as-a-measure-of-depth-control","line":20,"column":0,"depth":3},"relative-volume":{"type":"header","text":"Relative volume","value":"relative-volume","line":28,"column":0,"depth":3},"volume-balancing":{"type":"header","text":"Volume balancing","value":"volume-balancing","line":32,"column":0,"depth":2},"framework-levels-of-volume":{"type":"header","text":"Framework: Levels of volume","value":"framework-levels-of-volume","line":41,"column":0,"depth":2},"level-1":{"type":"header","text":"Level 1","value":"level-1","line":58,"column":0,"depth":3},"level-2":{"type":"header","text":"Level 2","value":"level-2","line":62,"column":0,"depth":3},"level-3":{"type":"header","text":"Level 3","value":"level-3","line":67,"column":0,"depth":3},"level-4":{"type":"header","text":"Level 4","value":"level-4","line":72,"column":0,"depth":3},"level-5":{"type":"header","text":"Level 5","value":"level-5","line":80,"column":0,"depth":3},"level-6":{"type":"header","text":"Level 6","value":"level-6","line":86,"column":0,"depth":3},"gain-staging":{"type":"header","text":"Gain Staging","value":"gain-staging","line":92,"column":0,"depth":3},"strategy-for-volume-level-setting":{"type":"header","text":"Strategy for volume level setting","value":"strategy-for-volume-level-setting","line":108,"column":0,"depth":2},"measures-of-volume":{"type":"header","text":"Measures of Volume","value":"measures-of-volume","line":141,"column":0,"depth":2},"db-spl-sound-pressure-level":{"type":"header","text":"dB SPL (Sound Pressure Level)","value":"db-spl-sound-pressure-level","line":144,"column":0,"depth":3},"db-fs-full-scale":{"type":"header","text":"db FS (Full Scale)","value":"db-fs-full-scale","line":148,"column":0,"depth":3},"rms-root-mean-square":{"type":"header","text":"RMS (Root Mean Square)","value":"rms-root-mean-square","line":151,"column":0,"depth":3},"lufs-loudness-unit-full-scale":{"type":"header","text":"LUFS (Loudness Unit Full Scale)","value":"lufs-loudness-unit-full-scale","line":162,"column":0,"depth":3},"loudness-range-lra":{"type":"header","text":"Loudness Range (LRA)","value":"loudness-range-lra","line":172,"column":0,"depth":3}},"children":[],"parent":"v89y5ry5pbgeazv7v5jr4me","data":{}},"body":"<h1 id=\"volume\">Volume<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#volume\"></a></h1>\n<p>Remember that apparent volume is what matters, not dB. The shape of the soundwave also affects how loudly we perceive something</p>\n<ul>\n<li>even at the same dB level, a chainsaw will sound much louder than a flute because of the shape of the soundwave.</li>\n</ul>\n<p>Once an instrument playing a certain pattern is heard, it is safe to blend back into the mix, where even if it is barely audible, the listener will be able to clearly discern what is being played, due to the fact they've already heard it.</p>\n<ul>\n<li>ex. a common pattern for a song has a guitar playing solo, only to be joined by other instruments progressively. Once these other instruments get added, it's fine to lower the volume on the guitar, since its distinctive pattern has already been heard and the listener can fill in the blanks on their own.</li>\n</ul>\n<p>It is not uncommon for the engineer to vary the volume faders throughout the song as dynamics change (ex. instruments are added, entering a new section of the song etc.)</p>\n<ul>\n<li><a href=\"/notes/enqduojp3hdl58v8o73g2l8\">compressors</a> can only do so much before they start sounding unnatural.</li>\n</ul>\n<p>The volume fader is the volume of the track after the FX pipeline has been applied to it. </p>\n<ul>\n<li>It is the volume level that will be piped into the it's <code>send</code> (ie. the next place in the pipeline)</li>\n</ul>\n<h3 id=\"volume-as-a-measure-of-depth-control\">Volume as a measure of depth control<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#volume-as-a-measure-of-depth-control\"></a></h3>\n<p>Conceptually, in a 3D space, a higher volume would indicate that the sound is closer to us. But if we want a sound to be perceived as closer to the listener, the solution is not always as simple as increasing the volume. There are 2 things to understand with this:</p>\n<ol>\n<li>Different frequencies decay through space at different rates, meaning that as you move closer to or further from a sound, the relative levels of different frequencies will change.</li>\n</ol>\n<ul>\n<li>higher frequencies decay at a faster rate, which is why when a distant sound first approaches you, you may find that you hear only the bass frequencies at first, followed by the rest of the sound (or vice versa, depending on the physical environment)</li>\n</ul>\n<ol start=\"2\">\n<li>The clarity of a sound deteriorates with distance. The further away a sound is, the more muffled it appears.</li>\n</ol>\n<p>For these reasons, we need some other tools (together along with volume) to create the illusion of depth, such as <a href=\"/notes/enqduojp3hdl58v8o73g2l8\">compression</a></p>\n<h3 id=\"relative-volume\">Relative volume<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#relative-volume\"></a></h3>\n<p>When doing your initial volume setting of each track, it's easier to scope small and gently expand outward</p>\n<ul>\n<li>ex. volume-match your cellos first, then your string section, then your brass section, then your string section AND brass section, and so on.</li>\n</ul>\n<h2 id=\"volume-balancing\">Volume balancing<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#volume-balancing\"></a></h2>\n<p>Volume balancing should be the first step of any mix.</p>\n<p>Can use a strategy of <em>height order</em>, where we loop the loudest part of the sound (with likely the most instruments playing simultaneously)</p>\n<ol>\n<li>Turn everything all the way down</li>\n<li>Choose which instrument is the most important (e.g. kick, snare, vocal etc), and bring it up to -5dB</li>\n<li>Next, bring up the next most important element and balance it with that first most important instrument</li>\n<li>Continue this process until everything is balanced around that single most important instrument</li>\n</ol>\n<h2 id=\"framework-levels-of-volume\">Framework: Levels of volume<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#framework-levels-of-volume\"></a></h2>\n<p>A useful framework for thinking about relative (apparent) volumes is to place each instrument in one of 6 levels</p>\n<ul>\n<li>positioning of snare is quite varied, and depending on the genre, can appear from level 4 to level 2\n<ul>\n<li><a href=\"https://youtu.be/TEjOdqZFvhY?t=6540\">ref</a></li>\n</ul>\n</li>\n<li>vocals can also appear at various levels depending on genre and how strong the vocalist is\n<ul>\n<li><a href=\"https://youtu.be/TEjOdqZFvhY?t=6385\">ref</a></li>\n</ul>\n</li>\n<li>kick drum may appear at various levels as well.\n<ul>\n<li>ex. Kick drum in Jimi Hendrix' music is at around level 4 and can barely be heard</li>\n<li>ex. Heavy metal commonly places kick drum around level 2</li>\n<li><a href=\"https://youtu.be/TEjOdqZFvhY?t=6668\">ref</a></li>\n</ul>\n</li>\n<li>bass guitar was traditionally quite low at level 3/4, but has progressively gotten louder and is commonly found at level 2/3\n<ul>\n<li>commonly, the fewer instruments in the mix, the louder the bass, since it does a good job of filling out the space between the speakers</li>\n</ul>\n</li>\n<li>consider that a song can have varying ranges of volume levels, that is often influenced by genre\n<ul>\n<li>ex. some music has a range than spans only volume levels 2-4, while others might cover all\n<ul>\n<li>Pink Floyd's music typically has quite a wide range of volume levels</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"level-1\">Level 1<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#level-1\"></a></h3>\n<p>An unusually loud volume. Placing instruments at this level is the exception rather than the rule. If not done carefully it can sound like an error</p>\n<ul>\n<li>ex. the alarm clocks at the start of Time by Pink Floyd</li>\n</ul>\n<h3 id=\"level-2\">Level 2<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#level-2\"></a></h3>\n<p>Lead instruments and vocals (when vocals/lyrics are meant to be the main focal point of the song)</p>\n<ul>\n<li>ex. Bob Dylan's music normally has vocals at this level</li>\n<li>ex. \"kick\" drum in hip hop, kick drum and toms in heavy metal</li>\n</ul>\n<h3 id=\"level-3\">Level 3<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#level-3\"></a></h3>\n<p>Primary rhythm parts</p>\n<ul>\n<li>ex. guitar, keyboard, vocals (when not meant to be the dominant focal point)</li>\n<li>ex. kick drums (heavy metal), snare (dance music), toms, cymbals, hi-hat (occasionally)</li>\n</ul>\n<h3 id=\"level-4\">Level 4<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#level-4\"></a></h3>\n<p>Rhythm beds and chordal pads</p>\n<ul>\n<li>ex. background piano, background strings, keys, guitar</li>\n<li>ex. drums (jazz)</li>\n<li>ex. hi-hat</li>\n</ul>\n<p>When reverb is noticeable as a sound on its own, it is usually at this level</p>\n<h3 id=\"level-5\">Level 5<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#level-5\"></a></h3>\n<ul>\n<li>ex. Kick drum (jazz, big bang music)</li>\n<li>ex. Background vocals</li>\n</ul>\n<p>lots of FX and reverb live at this level so you can only hear them if listening closely</p>\n<h3 id=\"level-6\">Level 6<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#level-6\"></a></h3>\n<p>Soft and hard to detect sounds</p>\n<ul>\n<li>ex. whisper sounds found in Pink Floyd music</li>\n</ul>\n<hr>\n<h3 id=\"gain-staging\">Gain Staging<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#gain-staging\"></a></h3>\n<p>The source signal of an audio track goes through a pipeline before it ultimately arrives at the master bus.</p>\n<ul>\n<li>ex. this pipeline might be:\n<ol>\n<li>the guitar signal is WAV audio track</li>\n<li>the track is in an <code>Acoustic Guitar</code> bus (ie. folder in Reaper)</li>\n<li>the <code>Acoustic Guitar Bus</code> gets routed into the <code>Acoustic Verb</code> send, which gets routed to the <code>Guitars Bus</code></li>\n<li>and so on</li>\n</ol>\n</li>\n</ul>\n<p>Some steps of the pipeline will naturally involve some level of volume increase</p>\n<ul>\n<li>ex. compression, reverb and EQ are all stages that add volume to the mix</li>\n</ul>\n<p>Because one of the first steps of mixing is to set the fader levels, we don't want our compressor/EQ adding perceptible volume to the track. Therefore, when we are happy with the parameters of our FX, we need to A/B test it by bypassing it on and off. Adjust the volume level of the <code>B</code> to match the <code>A</code>.</p>\n<ul>\n<li>ex. Imagine we are A/B testing our compressor on the guitar. We toggle the FX on, and adjust up/down the post-FX gain (?) so that it matches the perceived volume level when the FX is off</li>\n</ul>\n<hr>\n<h2 id=\"strategy-for-volume-level-setting\">Strategy for volume level setting<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#strategy-for-volume-level-setting\"></a></h2>\n<p>A good way of achieving good balance of volume is to put your volume very low and walk into the next room. Get to a point where you can barely hear the sound. The element that pops out the most is too loud and should be brought down </p>\n<hr>\n<p>The biggest game changer for me was when I realized how important the volume sliders on each track are and developing a good strategy for how to use them. My goal when mixing is to let everything have its turn. I do this by imagining you only get to hear one thing at a time. If a drum is struck, its attack should be louder than anything else and it is the only thing that needs to be heard. But luckily there’s lots of space between drums because they are percussion instruments. As soon as the transient attack decays from its peak I don’t need to hear it anymore, and now there’s all this wonderful open space inbetween each drum hit where I no longer need to hear the drum and am free to hear something else: but again, I only get to pick one thing to hear at a time in these spaces between the drums. Using this idea I try to set my levels loudest on the tracks that have the highest transients and lowest for the things that have the slowest decays.</p>\n<p>So for example let’s say I have the following tracks: a drone synth pad, some guitars, bass, vocals, and drums. First thing to do is pull down all your faders so everything is silent. Then I’ll start by bringing up the synth pads first because they are long passages of relatively equal volume that don’t change a whole lot. They are the least dynamic of all the tracks. I bring them up to a decent level but not too high because everything else needs to go on top of them. Maybe about halfway. Next I’ll pull up the bass guitar because it has more dynamic attack than the pads but still lots of sustain (second-least dynamic of my tracks, so I address it second). My goal here is to bring the volume of the bass up so that when I watch the meters, the attack of the bass string being struck pops up above the volume of the synth pads. So long as that attack on the bass is louder than the pads, then I know I’ll hear the bass in my mix, even if the sustain drops below the pads afterward.</p>\n<p>In essence what we’ve got now is kind of like a rolling fog of synth pads with mountain peaks of bass transients popping up through that fog. I’ve made space for both now. When the bass is plucked I hear it (and not the synth pad) but when it decays below that fog I hear the synth (inbetween the peaks of bass note attack). By doing this I’ve made dynamic space for both in the temporal plane. It’s like eq for time instead of frequency! Everybody knows you should  use eq to carve space in the frequency domain. But it took me forever to realize I need to use volume dynamics to carve space out of time! How did I not see that sooner???</p>\n<p>So next I’ll do the same for guitars. They’re generally similar in volume to the bass, but with a bit more transient attack. I also use wide panning on the guitars so their peaks can be heard above the fog in the L/R space whereas the bass peaks pop up down the centre. But yeah, I want their peaks just above the bass, but doesn’t need to be by much for the reasons I just mentioned.</p>\n<p>Next is the vocals. Consonants and plosives are even more dynamic than guitars, bass or pads. So my goal is to get the vocal transients to pop up above the cloud cover of everything else so far. I raise the fader on my vocals until the volume peaks crest the summed volume of everything else set so far. It can be handy to temporarily group or route your synth, bass and guitars to one bus so that you can watch their summed volume meter next to the vocal track meter to ensure the vocal peaks crest everything else.</p>\n<p>And lastly, drums are the most dynamic with super fast attack and decay. So I set them loudest so they peak above everything else.</p>\n<p>If I’ve successfully done my job here, when a drum is hit I hear the drum and then it quickly gets out of the way with a fast decay to make space. And in that space between drum hits, a vocal consonant pops up and is heard above all else and then gets out of the way for other things to be heard. And in the spaces between drum hits and vocal consonants, the pluck of a guitar string rises above everything else and then gets out of the way. And now in the space between drum hits, consonants and plucked guitars, a bass note rises above and then drops away… to reveal the synth pad that is droning along in all the remaining spaces between and under everything else.</p>\n<p>The idea here is that you don’t actually get to hear everything at the same time. If everything was hard compressed and set to equal volumes you’d just hear a long muddy wash of all tracks playing at once. Unless that’s what you’re specifically going for that’s generally not what you want. It’s boring to listen to because it isn’t changing. But if your brain hears a drum and then a word and then a guitar chord and then a bass note and then a synth pad… one at a time in quick succession… it gets excited!!!! There’s a lot of different things happening quickly over time for it to process… instead of everything happening at once all the time without any change in focus.</p>\n<p>Now since music generally has a rhythmic component you may wonder how this can work when all tracks play on the same beat? Well, it still works because we ordered it so that the quickest decay is loudest. In this case you hear the drum on the beat first because it’s loudest. But it dies away so quickly (fast decay) that it drops out to reveal the consonant of the vocal milliseconds later. It should decay fast enough that you don’t miss hearing most of the consonant! But then the consonant drops off too and you hear that guitar chord coming through now… and you may only be getting that last bit of the guitar strum attack but it’s enough. And as that last bit of the guitar attack decays it reveals the bass underneath. And maybe you missed hearing most or even all of the actual bass attack underneath everything else but that warm early sustain now shines through and is like syrup after the percussive attack of everything else, and as it dies away, it reveals below everything else our ever-present synth pad holding it all together. At this point you for sure missed hearing the attack of the synth but it doesn’t matter because it barely has any attack to speak of anyway. So yeah, that’s why it’s important to set your levels so the meters peak loudest on the fastest, most dynamic tracks. Because even if every track plays each note at the exact same time this strategy allows each layer to peel away and reveal the track underneath.</p>\n<p>Once I started thinking about things this way I realized I could get 80% of the way there with just the faders and nothing else. Which is crazy because I saw them as second-class citizens to the jobs of eqs and compressors and reverbs and panning for so long. But they are SO critical despite their bare simplicity!!! I’m self-trained so maybe I’m an idiot for not having understood this sooner and everyone else already knew all this. But man, the simplest of things had the greatest effect.</p>\n<p>Furthermore, once you understand the “only one thing at a time” paradigm you realize the other tools are just more granular versions for achieving the same thing. For example: are all your tracks too dynamic? If they’re all super percussive then there’s not enough time to reveal those layers beneath. So what do you do? Well, that’s the compressor’s time to shine! Throw lots of compression on your synth, slightly less compression on your bass, a little less on your guitars, almost none on your vocals, and none at all on your drums, and now suddenly you’ve got a good range of low vs high dynamic tracks so that the layers can be peeled back to reveal everything beneath just like we want. Obviously there are so many more applications for compressors than just this, but prior to my thought that you should only be “hearing just one thing at a time” I never would have thought to use them in this application. Reverb is a good way to reduce dynamics too, but it can offer a pleasing stereo spatial component too. So it’s kind of like a “blurry” compressor if you think about it. Again… perhaps an oversimplification but not something I would have considered prior to understanding this paradigm! And I realized side-chaining is sometimes so effective because it’s just brute-forcing the “one thing at a time” concept to the extreme!</p>\n<p>But yeah, seriously. It’s ALL about volume and only having one loudest thing at a time. Once I got that, everything else just got better. And at the end of the day, I could still compress the hell out of the master to sound “loud enough”, but so long as I first gave everything it’s “time to shine” as the loudest part in the mix, then it still sounds relatively ok. Even if you have to brick wall the whole track because the client wants it “louder” and all the dynamics are lost (not great but sometimes that’s what they want), the clarity still remains intact in the temporal domain because you made sure only one primary thing needed to be heard at a time.</p>\n<p>Anyway, sorry that was so long. But just felt like if somebody had explained this to me at the outset I would have saved myself so many years of grief and confusion. So yeah, I hope at the very least that I can save somebody else from some of that misery.</p>\n<p>Lastly- I should say that if it sounds good you’re doing it right. This is as much art as it is science. Use the advice that works for you and drop the stuff that doesn’t. Don’t use my advice here if it does nothing for what you’re trying to accomplish. My word is certainly not law, and neither is anyone else’s. There’s a million ways to make this work. Find the ways that work best for you!</p>\n<h2 id=\"measures-of-volume\">Measures of Volume<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#measures-of-volume\"></a></h2>\n<p>A decibel (dB) is just a ratio, there has to be a reference level for it to become a unit (of sorts). </p>\n<h3 id=\"db-spl-sound-pressure-level\">dB SPL (Sound Pressure Level)<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#db-spl-sound-pressure-level\"></a></h3>\n<p>When the average person talks about \"decibels\" they are usually (unknowingly) talking about dB SPL which has some arbitrary definition of the lower limit of human hearing as a reference (according to wikipedia it's about as loud as a mosquito flying 3m away)</p>\n<ul>\n<li>ex. you can't exactly hear a gun shot and say 'that was 80dBs', because it relates to how far you are from the source and what reference you are using. If you were to move 50% closer, that 80 dB (SPL) would become 86 dB SPL, because now your perspective is different</li>\n</ul>\n<h3 id=\"db-fs-full-scale\">db FS (Full Scale)<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#db-fs-full-scale\"></a></h3>\n<p>When talking about audio in the digital realm, dBFS is used, but instead of the reference being the quietest possible limit, it's the loudest (imposed as a standard) and thus negative values are used to count back from the top. Any signal that passes above 0dB FS gets chopped off, which is known as digital clipping.</p>\n<h3 id=\"rms-root-mean-square\">RMS (Root Mean Square)<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#rms-root-mean-square\"></a></h3>\n<p>RMS represents the average (also called “integrated”) loudness of a signal. </p>\n<ul>\n<li>It will typically take a measurement every 300ms, which means whatever peaks occur within that time frame get averaged out for the RMS reading. So RMS isn’t as precise as peak metering, but it actually gives us a better understanding of overall loudness based on the average strength of the signal.</li>\n</ul>\n<p>RMS is useful for whenever you want a reading closer to a person’s actual perception of loudness.</p>\n<p>RMS is usually the unit used for the master track.</p>\n<p>Mathematically, we derive the RMS by taking the average value (ie. mean), squaring it, then taking the square root.</p>\n<ul>\n<li>we do this process of squaring then taking square root so that the resultant value is always positive.</li>\n</ul>\n<h3 id=\"lufs-loudness-unit-full-scale\">LUFS (Loudness Unit Full Scale)<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#lufs-loudness-unit-full-scale\"></a></h3>\n<p>LUFS is a measurement of perceived loudness obtained by measuring the average level over time.</p>\n<p>Two pieces of music that register identical LUFS readings should sound like they’re at the same level, regardless of whatever the peak or RMS readings say</p>\n<ul>\n<li>therefore, LUFS offers a benefit to the mastering process when we want all tracks to have the same volume level.</li>\n</ul>\n<p>LUFS-M - Momentary Max\nLUFS-S - Short-term Max\nLUFS-I - Integrated</p>\n<h3 id=\"loudness-range-lra\">Loudness Range (LRA)<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#loudness-range-lra\"></a></h3>\n<p>The lower the number, the less dynamics. </p>\n<ul>\n<li>since classical music tends to have many loud parts and quiet parts, you might find LRA of 9+, whereas rock music, which is typically more stable is usually around 5-6.</li>\n<li>Note that this is not about dynamic range, but rather, musical dynamics.</li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/notes/v89y5ry5pbgeazv7v5jr4me\">Mixing</a></li>\n<li><a href=\"/notes/enqduojp3hdl58v8o73g2l8\">Compressor</a></li>\n</ul>","noteIndex":{"id":"8qvi4S0Dk1BAaCLhfHqAp","title":"Second Brain","desc":"","updated":1672111562730,"created":1616360437888,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"../main/thoughts-on","name":"thoughts-on"},"contentHash":"dd394dade3f08feaa5cf4d1caeb1c991","links":[],"anchors":{"tags":{"type":"header","text":"Tags","value":"tags","line":12,"column":0,"depth":3}},"children":["8aPvLrwcPnxcTwx7PdvXW","l9ldUruxqRBZwMij5KlS5","xWh3SS0J1hvRSZ7g4LvEE","cc5kdn5ay8omhcud9hjfpyk","9jNuGCXVuFaZOGZfLpKi5","mhlpKRrfT0qlXzTaapFYZ","QU1tbQ4KX64UBCWtCxAcR","U4tQLU5tRHqr9e7H3G4Gm","PvcIkEJcDtcv7luF2mBIU","2wW5Kxk794H9mfnu9VPA8","iwANjkbi3nbIovlVpepWm","XYgvsgvjzgoyvY6KAEu5Y","pT9wnWnS42pFId9UIH5he","gmXZ6Xy8f8FFQ66Z5DYqh","CjV6QXVHIqQTuZTSlSSlB","IgbLitAU1k0ioGhuvmjjS","D42jFbx0vNlT7S6QRb5ee","dFs5zopMmrh3rPgQaSkyP","W0AgEfoTzJ8VxVE4QqhSL","ggU4P3K1OhUlHBJbpgHiD","vtu2srTzCfoNUHv0Xcbxn","6kuwlrc3PT5JoQS9xZWZW","qoZ6e9KsYPestYFpO4Ce4","GPH8BieqB4dtqul80gJvX","MbW1wF5mIZ7g3DPXrOSyZ","Ay9vOAmvV8ODJFpaEkw6J","8Pi3wPs4LTxlAEOUE48Te","SDd8268l79j2cnvCVVl8F","zI5rK8mFkNghzLgbQD6ox","zCwMY5ckgKAqstOhw2Drd","i5Fya3Vzzm0rBT0ctByuo","YDbL8QXchj03NvTIZOdrk","km4fy13hx9puopyjr1ajdgj","WdAyuDkIi16pl1pnaopzx","15ax6k6x106sotobkyn3jqp","sgu2QxqDGup93hJPx8RJd","mT663nw5DUEaEGzXI98yD","Dyg6bFtxE0UkB7gz6pqzq","cn1x9vhdapyt1fvgtvfekea","0aYhvzCfaIxLaNhqNCV9Q","q9NskCGxFGNQwBDcsgNkY","wAdoBPUMHEFJkm6XVlHXW","sCYBuXnSNA259MDwhakmv","YgQusR9D6RbBgdkLuJuDh","ovHaNSb3tnl2LTdV7wwau","eqklm05q2g46ikqaqv9ijh9","8TJC5FfwKtfmH4GfOZVoO","9rKIOn3BV7ZU1FFlJxmvC","rsrE9vBXK0ehNkbEjltlZ","XTkKLi0Jg1imZ2lbhgOrv","4Fuw6OHQ5uhEVCUfXDfkb","pUEyedPYYlNSVLuiUSnge","KtoCw0HFEddGJ7GuW7GnN","BoxZ36iWEbUoRProxPo4D","gCmclfAHAt1tEcFDc24eD","TNhxyx7GEdGDM0PBI08b1","guyW7WWQNDGDALFV7tO57","YeEWZtb7FWvYTyJwF7zhR","DUrXQvolf76ILMKJm4Zt6","Jo4jAQcwgxsdxkcxUceR4","X6yPFUKIjs6tENQ3uNzE2","aRSv8qoJLyeE6xDAAUYpU","jwb0toyj23byc7krttp0l8k","ztqrUgUYssC0FAWDGZxWF","d7evrjgli013nul3mosquea","mvBLIZW424WZ5mCmjKQaB","YoV6c5CmpHYNEuYU4PsgH","JQzF2iPfQ2897j6HFCoY9","TicwTJD2oaTpncpPy93s2","KiGGs6PmvIlIt50r2tF2O","4TiqSFRd4hD0e5tyHbf4d","8F9H6GIButHtrFKXHzZFu","t5CaAEDQFRutGrV0ru97d","het26IMKUnKB7npru8tG4","GgRKYXklrXEAs9u15sOM9","PPvKHQNulUEvXEitqAZxM","SMGOfSTElTkJBezhNvkZ6","358nLIVsR9zmItfuBCWq2","xewZxeuhzI7qMvoYdcnLM","FAAtgk8cbuownxuv0Vlou","64N1mdh3JWL1WOv1dilYD","aCd3q2zSzgQnHKi1vOJFj","kh7Y1bQw7Om31yurE4CrW","5162x506d5mgwkn07plcuo3","LGnyEtwA1LlztJJwEpg6l","zoJRWH59vBCpqnm8fOpis","xlg9pngfxviby5z2qfcfpcv","G6zDrHf3Ua8R7vllalBc5","NrjfBxxDU92ByYSIJjgDM","zNcMG5nj1t69zkAFnvn5S","JIHQPGBUDqAEPzbhfFxlc","MmjHaByLtYx5sv2HzXnWd"],"parent":null,"data":{},"body":"\nWelcome to my Second Brain! Here you'll find thoughts, lessons, facts and any other interesting musings that I've come across or thought up over the years. A lot of what I have gathered over the years are originally from the minds of others, while some are my own. Some may be outdated and no longer reflect my current views. Some may contain misinformation, though I try to be rigorous with my additions. You can think of it as my personal wiki.\n\nThis Dendron vault is the sister component to the [Tech-focused Digital Garden](https://tech.kyletycholiz.com)\n\n### Tags\nThroughout the Second Brain, I have made use of tags, which give semantic meaning to the pieces of information.\n\n- `ex.` - Denotes an *example* of the preceding piece of information\n- `spec:` - Specifies that the preceding information has some degree of *speculation* to it, and may not be 100% factual. Ideally this gets clarified over time as my understanding develops.\n- `anal:` - Denotes an *analogy* of the preceding information. Often I will attempt to link concepts to others that I have previously learned.\n- `mn:` - Denotes a *mnemonic*\n- `expl:` - Denotes an *explanation*"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":false,"leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2,"vaultSelectionModeOnCreate":"smart"}},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"randomNote":{},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"dendronVersion":"0.83.0","vaults":[{"fsPath":"../main/thoughts-on","name":"thoughts-on"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":true,"maxPreviewsCached":10,"maxNoteLength":204800,"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"enableUserTags":true,"enableHashTags":true,"enableEditorDecorations":true,"enableFullHierarchyNoteTitle":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enableMermaid":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"Dendron","description":"The non-Tech Second Brain of Kyle Tycholiz"},"github":{"cname":"thoughts.kyletycholiz.com","enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"master","editViewMode":"tree"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","enableMermaid":true,"siteUrl":"https://thoughts.kyletycholiz.com","duplicateNoteBehavior":{"action":"useVault","payload":["thoughts-on"]},"siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}