{"pageProps":{"note":{"id":"q5y4xvvcpx7jpbxvtytu1eh","title":"Attachment","desc":"","updated":1708890169418,"created":1698779412966,"custom":{},"fname":"parenting.attachment","type":"note","vault":{"fsPath":"../main/thoughts-on","name":"thoughts-on"},"contentHash":"ff4024b574a389a79ace5fd27acfee70","links":[],"anchors":{"connection":{"type":"header","text":"Connection","value":"connection","line":28,"column":0,"depth":3},"boundaries":{"type":"header","text":"Boundaries","value":"boundaries","line":51,"column":0,"depth":3},"dependence":{"type":"header","text":"Dependence","value":"dependence","line":67,"column":0,"depth":3},"mountain":{"type":"header","text":"Mountain","value":"mountain","line":83,"column":0,"depth":3},"tantrums":{"type":"header","text":"Tantrums","value":"tantrums","line":91,"column":0,"depth":3},"analogy-filling-and-refilling-a-cup":{"type":"header","text":"Analogy: Filling and refilling a cup","value":"analogy-filling-and-refilling-a-cup","line":97,"column":0,"depth":3}},"children":[],"parent":"ztqrUgUYssC0FAWDGZxWF","data":{}},"body":"<h1 id=\"attachment\">Attachment<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#attachment\"></a></h1>\n<p>Attachment is about forming strong relationships with the child so they can feel comfortable leaning on you while they develop</p>\n<p>As children begin to feel safe and settled in the world that surrounds them, and at the same time come to understand subconsciously that their big people are moving quietly and persistently on their behalf to ensure this happens, their regulatory systems settle, Leading them to more likely keep their reactions in check when situation escalates. </p>\n<p>There are 3 situations that will trigger the child’s attachment system</p>\n<ol>\n<li>When they are sick</li>\n<li>When they are physically hurt</li>\n<li>When they are emotionally hurt</li>\n</ol>\n<p>For the first 2, parents generally respond well, giving connection that the child desires. The third however is often <em>not</em> met with connection from the parent, even though the same part of the brain is being activated in all 3.</p>\n<p>Bad behaviour results from either</p>\n<ol>\n<li>Normal child development</li>\n<li>Disconnect with the parent</li>\n</ol>\n<p>A child must satisfy their attachment needs before they can emerge.</p>\n<p>Attachment and orientation (ie. finding ones way in the world) are inextricably linked. We automatically orient ourselves by seeking cues from those we are attached to.</p>\n<ul>\n<li>Children can not be oriented toward parents and their peers simultaneously, since each provides a conflicting direction. </li>\n</ul>\n<h3 id=\"connection\">Connection<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#connection\"></a></h3>\n<p>Connection through relationship grows the foundational core of the brain and governs the regulatory state of the growing child</p>\n<ul>\n<li>A solid relationship leads to a more regulated brain, and a more regulated brain leads to a more subtle child, which allows for neurological and emotional connections to take root and eventually lead to true maturity</li>\n<li>Therefore, the relationship must be guarded above almost all else. Avoid doing things that harm the relationship, and never do things that lead the child to think you are not the \"end all be all\" for them.</li>\n</ul>\n<p>When a child is mad, you must show them that they are heard</p>\n<ul>\n<li>\"Hey man, you seem really mad right now. I get that. It's frustrating when you're in the middle of building your lego tower and something like dinner has to interrupt that. I get it. That's frustrating!\"</li>\n<li>\"You called me a bad dad. I get why you might feel that way.\"\n<ul>\n<li>notice that here we are simply acknowleding— not agreeing.</li>\n</ul>\n</li>\n</ul>\n<p>Come alongside your child to get them onside</p>\n<ul>\n<li>connect with them before asking them to do something. Instead of just saying, “go upstairs and do the laundry”, first connect with them in a way that says “I see you”. Comment on the Lego structure they are building. Comment on their choice of clothes for the day. Ask a question about the game they are currently engaged in.</li>\n<li>what we are doing here is organically priming their brain to be on our side, which increases the likelihood of compliance. </li>\n</ul>\n<p>As adults, we have this tendency to respond to our child’s fears, disappointments, and otherwise unhappy moments without a passionate understanding. Consider that it is easier to empathize with an adult than it is a child. When our friend loses a loved one, it's easy to put ourselves in their shoes and show them true empathy. As the listener, we manifest this empathy by giving them a sympathetic ear, looks of support and a calm gentle tone of voice. However, it is quite another matter to empathize with children. We might think it's cute when they tell us about a nightmare they had where their broccoli was eating them. We don't intuitively understand their fears, because to us it's not a frightening experience.</p>\n<ul>\n<li>Consider the same point for other emotions, like frustration. Most adults wouldn't find it overwhelmingly frustrating if the ice cream parlour was out of our favorite flavour, so we don't naturally have empathy for our child who does indeed feel overwhelmed by their frustration and anger.</li>\n</ul>\n<p>Never use the idea of connection as a bargaining chip</p>\n<ul>\n<li>ex. When you give your child a timeout because they are not behaving, you are implementing the idea that “if you don’t behave, you will lose the positive attention from me”. \n<ul>\n<li>the child has a foundational need for connection, and in our example, it is only being conditionally met. That is, the child only achieves it based on some condition. So we essentially are bullying them into acting a certain way in order to get that connection.</li>\n</ul>\n</li>\n</ul>\n<p>Our goal as parents is to gift our children as many opportunities as possible (especially challenging moments) to affirm their safety through an unconditional connection to us.</p>\n<h3 id=\"boundaries\">Boundaries<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#boundaries\"></a></h3>\n<p>Set intuitive boundaries for your child</p>\n<ul>\n<li>anal: Consider the guard rails of a bridge. For the vast majority of cases, they do nothing to actually prevent disaster. They do however, provide a sense of safety.</li>\n</ul>\n<p>It is important to provide boundaries for your children, but not in a way that if they cross those boundaries, we react negatively. A child needs to feel that those boundaries exist, yet we as the parent need to know when to allow those boundaries to be moved a little. In these cases, we need to get ahead of it and not allow the child to cross the boundary themselves, but offer them the opportunity to cross the boundary.</p>\n<ul>\n<li>ex. Imagine we set our children up for soccer lessons, and they had agreed to go every Tuesday and Thursday. This is a commitment, and a clear boundary to what they are expected to do. However, there will be times when the child feels overwhelmed and on able to participate in the lesson. It is not up to us to ensure that the child goes to in the lesson. We should be attuned to our child’s emotions, and offer them the opportunity to skip the lesson for that day, should the child need it. This needs to be done in a way that shows we are in charge and that we are making the decision, based on their feelings (\"I can see that today feels like a really tough day. Let's skip soccer practice and go get some ice cream instead.\"). Notably, we get ahead of it before our child asks us if they can skip the soccer lession that day.</li>\n</ul>\n<p>Don’t explain the rationale for boundaries in the moment. Wait until later once the child has excepted the boundary, they are emotionally settled, and you have engaged the child in a moment of connection.</p>\n<ul>\n<li>ex. Before dinner, your child asks if they can have a cookie. You say \"no\". Their response is, \"why?\" Once you say something like \"because it will spoil your appetite\", you open them up to engage in a boundary dispute with you. Instead, simply say \"we will talk about that later. The answer is no\"</li>\n</ul>\n<p>Let your child’s needs inform your decisions, but always make it seem like you are in charge.</p>\n<ul>\n<li>ex. You may typically not have cookies before dinner, you may recognize that your child has had a very hard day, and you denying her the cookie before dinner will lead to a meltdown. So when she asks for the cookie, you say “I was just about to say let’s have a dessert first kind of night!”. That way, the child doesn’t think they had any influence on the boundary, but they still get the connection from us.</li>\n</ul>\n<p>Imagine a scenario where you have already said no to what your child has requested, but after some back-and-forth, you realize that your child really needs this and it’s not worth the impending meltdown if you stick to your guns. Find a way to not allow your child to think they influenced the boundary, but still give them what they want. </p>\n<ul>\n<li>ex. Your child’s typical routine is that after dinner, they get to watch one episode of their favourite show. After the episode has finished, your child asks for one more. Sticking to your guns, you say no. Then you can sense that because your child has had a hard day, they start to argue back. At this moment, you realize that the connection gained from allowing them to have one more episode is worth it. But instead of saying something conciliatory like “ok honey you were right, you can have one more show”, find a way to exit the loop gracefully. Say something like “you know what, I just realized I left the sprinkler on outside. Give me a few minutes, and we’ll talk a little later. In the meantime, enjoy your show”.</li>\n</ul>\n<h3 id=\"dependence\">Dependence<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#dependence\"></a></h3>\n<p>Your child needs to feel that they can depend on you no matter what. Don't get caught up in the trap of making them do things on their own that they should know how to do already.</p>\n<ul>\n<li>ex. if they are asking you to help put their jacket on, you are not harming their quest to independence by helping them. In fact, you are supporting their intuiting that they can rely on you for anything, allowing them to grow in their own time when they are ready for it.</li>\n</ul>\n<p>As a parent, your job is to demonstrate that you are in charge. This means showing that you understand them, understand the greater situation, and understand what needs to be done. You must avoid showing them that you don't understand something, or that some situation is out of your control. This is what causes your child to have confidence in you and allows them to depend on you.</p>\n<p>Demonstrate a confidence to your child that shows them that you are in charge and that you understand them and their needs</p>\n<ul>\n<li>if possible, avoid having to ask them questions around why they need your attachment, and just give it. Demonstrate to them that you already \"get it\", without even having to be asked.</li>\n<li>take charge when you can sense that your child is feeling vulnerable. Take their hand, instead of asking and explaining: \"can you give me your hand, because...\"</li>\n</ul>\n<p>Your role as the parent is to provide a safe space from which the child can explore. That is, you want them to feel they can depend entirely on you, so they can grow into their role as an independent person on their own time.</p>\n<ul>\n<li>There will be dips in this progress toward independence. For example, a break in the child's routine or them being sick may cause them to \"regress\" and seem more dependent on you. Allow them to do this. </li>\n</ul>\n<p>A child's dependence on the parent is key, because it allows them to go through the normal, healthy emotional processes that come when dealing with upsetting emotions (like disappointment), and then experience what it is to grieve and recover, which helps them develop resilience along the way.</p>\n<ul>\n<li>if you are not a figure upon which they can depend, the child will become highly distressed and tend towards dissociation, resulting in them turning off their feelings to avoid the ongoing pain whenever their true needs are not met.</li>\n</ul>\n<h3 id=\"mountain\">Mountain<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#mountain\"></a></h3>\n<p>When confronted with unwanted negative behaviour in a child, a parent will tend toward either: firmness or appeasement.</p>\n<ul>\n<li><em>firmness</em> - putting up clear boundaries and stating expectations and not letting up</li>\n<li><em>appeasement</em> - becoming a people pleaser and offering to make amends</li>\n</ul>\n<p>The more we stay in whichever tendency we veer towards, the closer we get to either a bully (in the case of firmness) or a jellyfish (in the case of appeasement). As we get closer down the mountain on either side, it's ever more important to find our way to the other side.</p>\n<ul>\n<li>ex. if we have a tendency toward firmness, then after we have been firm for a while, we need to go on the side of appeasement. This might mean that shortly after the confrontation, we suggest to the child to go do something they love to do. \"Hey buddy, how about we go out for a bike ride?\". This shows the child that we still love them and that nothing has damaged the bond between you and your child.</li>\n</ul>\n<h3 id=\"tantrums\">Tantrums<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#tantrums\"></a></h3>\n<p>When a child is throwing a tantrum and breaking things, we should prevent them from breaking those things (preferably without resorting to grabbing them to prevent them). </p>\n<ul>\n<li>ex. if they are banging dishes around, put your hand between the dish and the table. Give them validation on their feelings (\"I can see you're really mad right now. I get that\")</li>\n</ul>\n<p>When a child is throwing a tantrum, don't put up a barrier of resistance. Instead, offer validation. If you put up resistance to a negative behaviour, you are making them push back on it. If you instead offer validation and understanding, they have nothing to push back on and eventually fall into you.</p>\n<h3 id=\"analogy-filling-and-refilling-a-cup\">Analogy: Filling and refilling a cup<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#analogy-filling-and-refilling-a-cup\"></a></h3>\n<p>The primary caregiver is a child’s reservoir. The child’s need for attachment with them is like a cup that is emptied by being hungry, tired, lonely or hurt. The cup is refilled by being loved, fed, comforted and nurtured.</p>\n<ul>\n<li>playing and chit chatting when the child is happy also refills the cup.</li>\n<li>as children get older, just thinking about their caregiver can fill the cup. In fact, securely attached children can get their cup refilled from friendships, from having fun, or from learning something new and interesting at school.</li>\n<li>some children demand constant topping off of their cup, coming to adults for the smallest of things– such as tattling on their playmates. If their cups aren’t totally full they go into a panic.</li>\n<li>some children need a refill but aren’t able to get it. They lock the caps on their cups so they won’t lose the little that is left, but then close themselves off from getting a refill easily. Lacking confidence in the refilling process, they might refuse a hug, or refuse to go to bed, or refuse to sit and eat dinner. </li>\n</ul>\n<p>It’s helpful to look at a child’s behaviour through the lens of the state of their cup, especially when they are approaching empty. When they are bouncing off the walls and not listening, think of them as racing around trying to desperately refill their cups.</p>\n<hr>\n<p>Children with secure attachment can soothe themselves, can handle their emotions, pay attention, connect well with peers, and feel good about themselves and the world.</p>\n<p>The key to secure attachment is responsiveness– a sensitive response to the child’s needs by the caregiver.</p>\n<p>Mirroring is a perfect connection game: just do exactly what the child does. If a baby is looking at you with a serious face, look back at them with the same expression. If your kid is shaking his leg in an anxious way, start shaking your leg in the same way.</p>\n<ul>\n<li>mirroring creates a moment of closeness and deeply felt connection</li>\n<li>It’s important to make sure you don’t make them feel mocked. </li>\n</ul>","noteIndex":{"id":"8qvi4S0Dk1BAaCLhfHqAp","title":"Second Brain","desc":"","updated":1672111562730,"created":1616360437888,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"../main/thoughts-on","name":"thoughts-on"},"contentHash":"dd394dade3f08feaa5cf4d1caeb1c991","links":[],"anchors":{"tags":{"type":"header","text":"Tags","value":"tags","line":12,"column":0,"depth":3}},"children":["8aPvLrwcPnxcTwx7PdvXW","l9ldUruxqRBZwMij5KlS5","xWh3SS0J1hvRSZ7g4LvEE","cc5kdn5ay8omhcud9hjfpyk","9jNuGCXVuFaZOGZfLpKi5","mhlpKRrfT0qlXzTaapFYZ","QU1tbQ4KX64UBCWtCxAcR","U4tQLU5tRHqr9e7H3G4Gm","PvcIkEJcDtcv7luF2mBIU","2wW5Kxk794H9mfnu9VPA8","iwANjkbi3nbIovlVpepWm","XYgvsgvjzgoyvY6KAEu5Y","pT9wnWnS42pFId9UIH5he","gmXZ6Xy8f8FFQ66Z5DYqh","CjV6QXVHIqQTuZTSlSSlB","IgbLitAU1k0ioGhuvmjjS","D42jFbx0vNlT7S6QRb5ee","dFs5zopMmrh3rPgQaSkyP","W0AgEfoTzJ8VxVE4QqhSL","ggU4P3K1OhUlHBJbpgHiD","vtu2srTzCfoNUHv0Xcbxn","6kuwlrc3PT5JoQS9xZWZW","qoZ6e9KsYPestYFpO4Ce4","GPH8BieqB4dtqul80gJvX","MbW1wF5mIZ7g3DPXrOSyZ","Ay9vOAmvV8ODJFpaEkw6J","8Pi3wPs4LTxlAEOUE48Te","SDd8268l79j2cnvCVVl8F","zI5rK8mFkNghzLgbQD6ox","zCwMY5ckgKAqstOhw2Drd","i5Fya3Vzzm0rBT0ctByuo","YDbL8QXchj03NvTIZOdrk","km4fy13hx9puopyjr1ajdgj","WdAyuDkIi16pl1pnaopzx","15ax6k6x106sotobkyn3jqp","sgu2QxqDGup93hJPx8RJd","mT663nw5DUEaEGzXI98yD","Dyg6bFtxE0UkB7gz6pqzq","cn1x9vhdapyt1fvgtvfekea","0aYhvzCfaIxLaNhqNCV9Q","q9NskCGxFGNQwBDcsgNkY","wAdoBPUMHEFJkm6XVlHXW","sCYBuXnSNA259MDwhakmv","YgQusR9D6RbBgdkLuJuDh","ovHaNSb3tnl2LTdV7wwau","eqklm05q2g46ikqaqv9ijh9","8TJC5FfwKtfmH4GfOZVoO","9rKIOn3BV7ZU1FFlJxmvC","rsrE9vBXK0ehNkbEjltlZ","XTkKLi0Jg1imZ2lbhgOrv","4Fuw6OHQ5uhEVCUfXDfkb","pUEyedPYYlNSVLuiUSnge","KtoCw0HFEddGJ7GuW7GnN","BoxZ36iWEbUoRProxPo4D","gCmclfAHAt1tEcFDc24eD","TNhxyx7GEdGDM0PBI08b1","guyW7WWQNDGDALFV7tO57","YeEWZtb7FWvYTyJwF7zhR","DUrXQvolf76ILMKJm4Zt6","Jo4jAQcwgxsdxkcxUceR4","X6yPFUKIjs6tENQ3uNzE2","aRSv8qoJLyeE6xDAAUYpU","jwb0toyj23byc7krttp0l8k","ztqrUgUYssC0FAWDGZxWF","d7evrjgli013nul3mosquea","mvBLIZW424WZ5mCmjKQaB","YoV6c5CmpHYNEuYU4PsgH","JQzF2iPfQ2897j6HFCoY9","TicwTJD2oaTpncpPy93s2","KiGGs6PmvIlIt50r2tF2O","4TiqSFRd4hD0e5tyHbf4d","8F9H6GIButHtrFKXHzZFu","t5CaAEDQFRutGrV0ru97d","het26IMKUnKB7npru8tG4","GgRKYXklrXEAs9u15sOM9","PPvKHQNulUEvXEitqAZxM","SMGOfSTElTkJBezhNvkZ6","358nLIVsR9zmItfuBCWq2","xewZxeuhzI7qMvoYdcnLM","FAAtgk8cbuownxuv0Vlou","64N1mdh3JWL1WOv1dilYD","aCd3q2zSzgQnHKi1vOJFj","kh7Y1bQw7Om31yurE4CrW","5162x506d5mgwkn07plcuo3","LGnyEtwA1LlztJJwEpg6l","zoJRWH59vBCpqnm8fOpis","xlg9pngfxviby5z2qfcfpcv","G6zDrHf3Ua8R7vllalBc5","NrjfBxxDU92ByYSIJjgDM","zNcMG5nj1t69zkAFnvn5S","JIHQPGBUDqAEPzbhfFxlc","MmjHaByLtYx5sv2HzXnWd"],"parent":null,"data":{},"body":"\nWelcome to my Second Brain! Here you'll find thoughts, lessons, facts and any other interesting musings that I've come across or thought up over the years. A lot of what I have gathered over the years are originally from the minds of others, while some are my own. Some may be outdated and no longer reflect my current views. Some may contain misinformation, though I try to be rigorous with my additions. You can think of it as my personal wiki.\n\nThis Dendron vault is the sister component to the [Tech-focused Digital Garden](https://tech.kyletycholiz.com)\n\n### Tags\nThroughout the Second Brain, I have made use of tags, which give semantic meaning to the pieces of information.\n\n- `ex.` - Denotes an *example* of the preceding piece of information\n- `spec:` - Specifies that the preceding information has some degree of *speculation* to it, and may not be 100% factual. Ideally this gets clarified over time as my understanding develops.\n- `anal:` - Denotes an *analogy* of the preceding information. Often I will attempt to link concepts to others that I have previously learned.\n- `mn:` - Denotes a *mnemonic*\n- `expl:` - Denotes an *explanation*"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":false,"leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2,"vaultSelectionModeOnCreate":"smart"}},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"randomNote":{},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"dendronVersion":"0.83.0","vaults":[{"fsPath":"../main/thoughts-on","name":"thoughts-on"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":true,"maxPreviewsCached":10,"maxNoteLength":204800,"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"enableUserTags":true,"enableHashTags":true,"enableEditorDecorations":true,"enableFullHierarchyNoteTitle":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enableMermaid":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"Dendron","description":"The non-Tech Second Brain of Kyle Tycholiz"},"github":{"cname":"thoughts.kyletycholiz.com","enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"master","editViewMode":"tree"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","enableMermaid":true,"siteUrl":"https://thoughts.kyletycholiz.com","duplicateNoteBehavior":{"action":"useVault","payload":["thoughts-on"]},"siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}