{"pageProps":{"note":{"id":"zI5rK8mFkNghzLgbQD6ox","title":"Evolution","desc":"","updated":1699207256957,"created":1616478407447,"custom":{},"fname":"evolution","type":"note","vault":{"fsPath":"../main/thoughts-on","name":"thoughts-on"},"contentHash":"8aa97d883cbadf0cc89afbb8f23303ca","links":[{"from":{"fname":"AI","id":"8aPvLrwcPnxcTwx7PdvXW","vaultName":"thoughts-on"},"type":"backlink","position":{"start":{"line":3,"column":32,"offset":211},"end":{"line":3,"column":55,"offset":234},"indent":[]},"value":"evolution"},{"from":{"fname":"antifragility","id":"mhlpKRrfT0qlXzTaapFYZ","vaultName":"thoughts-on"},"type":"backlink","position":{"start":{"line":69,"column":52,"offset":4624},"end":{"line":69,"column":75,"offset":4647},"indent":[]},"value":"evolution"}],"anchors":{"how-it-happens":{"type":"header","text":"How it happens","value":"how-it-happens","line":8,"column":0,"depth":1},"thought-experiment":{"type":"header","text":"Thought experiment","value":"thought-experiment","line":15,"column":0,"depth":2},"evolution-of-women":{"type":"header","text":"Evolution of Women","value":"evolution-of-women","line":40,"column":0,"depth":3},"microevolution":{"type":"header","text":"Microevolution","value":"microevolution","line":57,"column":0,"depth":3},"macroevolution":{"type":"header","text":"Macroevolution","value":"macroevolution","line":62,"column":0,"depth":3},"events":{"type":"header","text":"Events","value":"events","line":69,"column":0,"depth":1},"cambrian-explosion":{"type":"header","text":"Cambrian Explosion","value":"cambrian-explosion","line":70,"column":0,"depth":2},"facts":{"type":"header","text":"Facts","value":"facts","line":79,"column":0,"depth":1},"logic":{"type":"header","text":"Logic","value":"logic","line":90,"column":0,"depth":1},"points":{"type":"header","text":"Points","value":"points","line":91,"column":0,"depth":2},"questions-for-them-to-ponder":{"type":"header","text":"Questions for them to ponder","value":"questions-for-them-to-ponder","line":112,"column":0,"depth":2},"responding-to-arguments-against":{"type":"header","text":"Responding to arguments against","value":"responding-to-arguments-against","line":134,"column":0,"depth":2},"resources-to-show":{"type":"header","text":"Resources to show","value":"resources-to-show","line":154,"column":0,"depth":2},"ue-resources":{"type":"header","text":"UE Resources","value":"ue-resources","line":157,"column":0,"depth":1}},"children":[],"parent":"8qvi4S0Dk1BAaCLhfHqAp","data":{}},"body":"<h1 id=\"evolution\">Evolution<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#evolution\"></a></h1>\n<h1 id=\"how-it-happens\">How it happens<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#how-it-happens\"></a></h1>\n<p>New species evolve by splintering off from established ones, when populations of organisms become isolated from the main branch of their family and acquire sufficient differences to remain forever distinct. </p>\n<p>The parent species may survive indefinitely thereafter, or it may become extinct.</p>\n<p>Evolution is not about the survival of any one species; it is about the survival of the whole of nature (which can be thought of as “the survival of DNA itself”</p>\n<h2 id=\"thought-experiment\">Thought experiment<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#thought-experiment\"></a></h2>\n<ul>\n<li>Take 2 animals/plants (ex. A rabbit and a leopard)</li>\n<li>Start with a rabbit, and draw its parent to the left, and its parents' parent further to the left, and so on. \n<ul>\n<li>each node is surrounded on either side by its child and its parent. It’s easy to identify each of those nodes that surround it as part of the same species, since they all have more or less the same features.</li>\n</ul>\n</li>\n<li>continue this process of adding nodes (parents), and over millions of years we will have resulted in something that is quite distinct from a rabbit, even though we could never observe the changes from node to node (just like you cannot observe an hour hand on a clock move, or observe a child grow up)</li>\n<li>as we continue to go to the left (ie. back in time), we eventually arrive at the hairpin species– the common ancestor between the rabbit and the leopard. </li>\n<li>now, we start to go forward in time, but this time, toward the modern day leopard. \n<ul>\n<li>along the way we see many forks, some of which lead to species that eventually went extinct, and some further down the line which exist in the modern day</li>\n</ul>\n</li>\n<li>Continuing along the path, we eventually arrive at the leopard</li>\n</ul>\n<p>This thought experiment is the answer to the common plaint \"if humans are descended from chimpanzees, why are there still chimpanzees?\". Just as rabbits did not descend from leopards, humans did not descend from chimpanzees. Rabbits are cousins of leopards, just as humans are cousins of chimpanzees— we are just closer cousins.</p>\n<hr>\n<p>Consider the Madagascar moths and the flowers that are perfectly coloured to appeal to them. From the perspective of the moths, the flowers are like reliably productive milk cows, while from the perspective of the flowers, the moths are like reliable federal express service. Each side could have been said to have domesticated the other, selectively breeding them to do a better job than they previously did. </p>\n<p>Red flowers are almost certainly pollinated by birds rather than insects, due to the fact that insects don’t see red</p>\n<hr>\n<p>Humans are more likely to notice anything negative, and to treat it as more salient, a tendency evolution fostered because being injured, attacked, or eaten matters much more to the transmission of genes than pleasant experiences do.</p>\n<p>based on evolution, humans generally know which generalizations to make</p>\n<ul>\n<li>ex. a researcher shows a child a picture of an overweight dark skinned person, and says that he is part of a tribe. the child instinctively knows to generalize attributes like skin color and not generalize weight</li>\n</ul>\n<h3 id=\"evolution-of-women\">Evolution of Women<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#evolution-of-women\"></a></h3>\n<p>Men's tendency to aggression and women's tendency to submission is not just cultural, it's biological. </p>\n<p>Throughout history, men competed against each other for the opportunity to impregnate fertile women. This meant the most ambitious, aggressive and competitive men were more likely to pass down their genes, making the whole of males overall in this vein. </p>\n<p>On the other hand, women had no problem finding men to impregnate them. However, they also needed a lot more help, since children require lots of care. They needed a man to stay with them for longer periods of time, leaving them more desperate for the man to stay. This resulted in them having to agree to whatever conditions the man stipulated. Over time, these submissive qualities helped women to pass on their genes, making the overall pool of women more submissive. </p>\n<hr>\n<p>Evolution prefers to build on top of itself, rather than start from scratch</p>\n<ul>\n<li>expl. What results is modern human intelligence built on top of primitive human impulses</li>\n<li>ex. Self control is built on top of desire </li>\n</ul>\n<p>Rather seeing natural selection as a species related thing, see it as a gene related thing. Instead of animals beating each other out for survival and dominance, think of it as genes beating each other out for dominance. This is natural selection, and of course all genes together make up an organism. Important is to see it at the atomic scale that make up the whole organism</p>\n<p>There are three things that are needed for a species to be considered intelligent. opposable thumbs or otherwise something with which they can manipulate the environment. Predator eyesight which is eyes at the front of the head rather than the sides. And language with which information can be passed on to offspring</p>\n<h3 id=\"microevolution\">Microevolution<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#microevolution\"></a></h3>\n<ul>\n<li>Microevolution looks at changes within species over time—changes that may be preludes to speciation, the origin of new species.</li>\n<li>skeptics are at least to an extent willing to accept microevolution.</li>\n<li>ex. the evolution of a beak over time to adapt to the environment</li>\n</ul>\n<h3 id=\"macroevolution\">Macroevolution<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#macroevolution\"></a></h3>\n<ul>\n<li>\n<p>Macroevolution studies how taxonomic groups above the level of species change. Its evidence draws frequently from the fossil record and DNA comparisons to reconstruct how various organisms may be related.</p>\n</li>\n<li>\n<p>To arrive at a conclusion does not require direct observation. </p>\n<ul>\n<li>hypotheses can still be tested by checking whether they accord with physical evidence and whether they lead to verifiable predictions about future discoveries</li>\n<li>ex. evolution implies that between the earliest known ancestors of humans and the appearance of anatomically modern humans, one should find a succession of hominin creatures with features progressively less apelike and more modern, which is indeed what the fossil record shows. But one should not—and does not—find modern human fossils embedded in strata from the Jurassic period (65 million years ago).</li>\n</ul>\n</li>\n</ul>\n<h1 id=\"events\">Events<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#events\"></a></h1>\n<h2 id=\"cambrian-explosion\">Cambrian Explosion<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#cambrian-explosion\"></a></h2>\n<ul>\n<li>541 MYA (lasting about 20m years)</li>\n<li>This is the period where all of the phyla (the hierarchical class below\nkingdom) started appearing on the fossil record.\n<ul>\n<li>In other words, different type of animals started appearing.</li>\n</ul>\n</li>\n<li>This is the period that more resembles life right now, since before this,\nthere were no sentient beings walking around — only non-sentient plants,\nbacteria, fungi etc.</li>\n</ul>\n<h1 id=\"facts\">Facts<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#facts\"></a></h1>\n<ul>\n<li>There are between 10-14 million species on the planet, and we've discovered\n1.2 million.</li>\n<li>Traits that stick around longer will become stronger over time. The reason\nthey stick around could be because humans are interfering (ex. selecting\nchickens who lay more eggs), or it may be the more natural reason: The trait\nis helping them survive. No matter the cause, the result is the same.</li>\n<li>chimps are more closely related to humans than they are to gorillas\n<ul>\n<li>if you and your brothers dna can be linked to each other (due to their overwhelming similarities brought on from the same parent), then similar dna between species should be indicitive of a common ancestor among them </li>\n<li>on average, humans have 99.9% the same DNA as another human. Chimps have 88.8% the same DNA as humans overall</li>\n</ul>\n</li>\n</ul>\n<h1 id=\"logic\">Logic<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#logic\"></a></h1>\n<h2 id=\"points\">Points<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#points\"></a></h2>\n<ul>\n<li>Whales have an ancestor that lived on the land, the Indohyus. Mammals tend to\nlive on land. The reason is because mammals adapted to best handle their\nenvironment. In their partiular environment, the best way was to breathe in\noxygen. \n<ul>\n<li>a 50 million-year-old, dog-sized member of the extinct raoellidae ungulate family — had ears, teeth and bones that resembled whales, not other raoellids.\n<ul>\n<li>However, a whale is one of a few mammals that live in the water. How did\nthis happen? Less important is the question of why it happened, since\nthere are many reasons why a species may adapt and evolve. What is\nbetter is to realize that mammals almost exclusively live on the land.\nThe fact that there are a few that live in the water raises the question\n\"why?\". </li>\n</ul>\n</li>\n<li>Being able to duck under the water to avoid prey is a survival trait.\nThe Indohyus would do this. Logic would suggest that the species\nevolved over time to give rise to whales because there were more\nmanageable threats in the water than on land.</li>\n</ul>\n</li>\n<li>There are many similarities between every single species on the planet. This\nimplies that there is a common ancestor </li>\n<li>like humans, other hominids (like apes) can also get Down Syndrome, though it is not observed in any other animal. This implies some kind of genetic similarity between humans and apes.</li>\n<li>Consider how much variation there has been with dogs. If so much evolutionary change can occur in just a few centuries or even decades, just think about what might be achieved in ten or a hundred million years.</li>\n</ul>\n<h2 id=\"questions-for-them-to-ponder\">Questions for them to ponder<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#questions-for-them-to-ponder\"></a></h2>\n<ul>\n<li>Do you believe that horses and cows are more similar than horses and reptiles?\nor birds and reptiles?\n<ul>\n<li>If so, what makes them more similar? Are they just designed that way, or\nare they derived from the same place? If they are designed, why then do\nthey have microscopic similarities between each other, like same\nstructure of hooves, same teeth etc.</li>\n<li>Does it make sense that the more similar something is, the more likely\nthat they are derived from the same place?</li>\n<li>Mammals have lots in common. Babies are stored in the uterus.\nPlacentalias (a sub-mammal group; humans are here) have lots in common too. Their babies are stored in the uterus, until the baby is at a late stage of development.</li>\n<li>This logic shows that we have commonalities. How did they occur? Does\nthe logic make sense that if they were derived from a common\nancestor, that each produced species would have commonalities as\nwell as differences?</li>\n<li>It might be believed that these groupings exist (mammal, reptile etc.)\nas a convenience to name things that have similarities. What is\nbeing missed here, is that the reason they have similarities is\nbecause they are derived from a single source.</li>\n</ul>\n</li>\n<li>fossil records for humans go back farthest in Africa (4 million years). Anywhere else in the world, fossils of this age don't exist. This implies that we originated in Africa. As diaspora happened, tribes separated and maintained distance. Over hundreds of thousands of years, humans further adapted to their environment which caused them to look differently (resulting in different races)</li>\n<li>when you look at the landscape of Christianity what do you see? What do you make of the 100's of denominations? How are they similar? Different? Are there some that are more similar than others, or are they all equally different? Would you almost say that some have more similar DNA? If so, why do you think that is? Can you imagine a world where there was an arbitrary Christian Church, and both of its leaders disagreed on a topic, so they each made their own denomination? Wouldn't that result in a large web of denominations, with varying degrees of similarity?</li>\n</ul>\n<h2 id=\"responding-to-arguments-against\">Responding to arguments against<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#responding-to-arguments-against\"></a></h2>\n<ul>\n<li>saying \"if we came from monkeys, why are there still moneys is tantamount to\nasking, “If children descended from adults, why are there still adults?” \n<ul>\n<li>a child becoming an adult is a natural <em>evolution</em>, which causes\nconfusion.</li>\n</ul>\n</li>\n</ul>\n<hr>\n<p>Even if some trait didn’t provide an advantage it could still be carried along as long as it’s not harmful. That neutral trait may be shown to be advantageous or even disadvantageous at some point in the future</p>\n<p>The cockroach is about the same organism as it was millions of years ago because its characteristics were adaptive then and now.</p>\n<p>Humans have spent 99% of their evolutionary history as hunter gatherers </p>\n<ul>\n<li>This shows how dominant the environment of those early humans was in shaping our biology. To understand human biology is to understand what it was like to be a human during that period</li>\n<li>If we compressed the 4 million years of human evolution into a 24 hour clock, agriculture started at 23:55</li>\n</ul>\n<p>A high sense of mortality in a single person or their family will offer little to no evolutionary advantage, but a high sense of morality among an entire tribe will in fact offer an advantage over a less moral tribe. </p>\n<p>Once an organism has survived past the age of reproduction, the organism is evolutionarily useless</p>\n<h2 id=\"resources-to-show\">Resources to show<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#resources-to-show\"></a></h2>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Phylum#Animals\">list of phylum that make up the animal kingdom, and how they are categorized according to their similarities</a></li>\n</ul>\n<h1 id=\"ue-resources\">UE Resources<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#ue-resources\"></a></h1>\n<ul>\n<li><a href=\"http://humanorigins.si.edu/evidence/genetics/human-skin-color-variation\">http://humanorigins.si.edu/evidence/genetics/human-skin-color-variation</a> </li>\n<li><a href=\"https://en.wikipedia.org/wiki/Relationship_between_religion_and_science\">https://en.wikipedia.org/wiki/Relationship_between_religion_and_science</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Gene-centered_view_of_evolution\">https://en.wikipedia.org/wiki/Gene-centered_view_of_evolution</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/notes/8aPvLrwcPnxcTwx7PdvXW\">AI</a></li>\n<li><a href=\"/notes/mhlpKRrfT0qlXzTaapFYZ\">Antifragility</a></li>\n</ul>","noteIndex":{"id":"8qvi4S0Dk1BAaCLhfHqAp","title":"Second Brain","desc":"","updated":1672111562730,"created":1616360437888,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"../main/thoughts-on","name":"thoughts-on"},"contentHash":"dd394dade3f08feaa5cf4d1caeb1c991","links":[],"anchors":{"tags":{"type":"header","text":"Tags","value":"tags","line":12,"column":0,"depth":3}},"children":["8aPvLrwcPnxcTwx7PdvXW","l9ldUruxqRBZwMij5KlS5","xWh3SS0J1hvRSZ7g4LvEE","cc5kdn5ay8omhcud9hjfpyk","9jNuGCXVuFaZOGZfLpKi5","mhlpKRrfT0qlXzTaapFYZ","QU1tbQ4KX64UBCWtCxAcR","U4tQLU5tRHqr9e7H3G4Gm","PvcIkEJcDtcv7luF2mBIU","2wW5Kxk794H9mfnu9VPA8","iwANjkbi3nbIovlVpepWm","XYgvsgvjzgoyvY6KAEu5Y","pT9wnWnS42pFId9UIH5he","gmXZ6Xy8f8FFQ66Z5DYqh","CjV6QXVHIqQTuZTSlSSlB","IgbLitAU1k0ioGhuvmjjS","D42jFbx0vNlT7S6QRb5ee","dFs5zopMmrh3rPgQaSkyP","W0AgEfoTzJ8VxVE4QqhSL","ggU4P3K1OhUlHBJbpgHiD","vtu2srTzCfoNUHv0Xcbxn","6kuwlrc3PT5JoQS9xZWZW","qoZ6e9KsYPestYFpO4Ce4","GPH8BieqB4dtqul80gJvX","MbW1wF5mIZ7g3DPXrOSyZ","Ay9vOAmvV8ODJFpaEkw6J","8Pi3wPs4LTxlAEOUE48Te","SDd8268l79j2cnvCVVl8F","zI5rK8mFkNghzLgbQD6ox","zCwMY5ckgKAqstOhw2Drd","i5Fya3Vzzm0rBT0ctByuo","YDbL8QXchj03NvTIZOdrk","km4fy13hx9puopyjr1ajdgj","WdAyuDkIi16pl1pnaopzx","15ax6k6x106sotobkyn3jqp","sgu2QxqDGup93hJPx8RJd","mT663nw5DUEaEGzXI98yD","Dyg6bFtxE0UkB7gz6pqzq","cn1x9vhdapyt1fvgtvfekea","0aYhvzCfaIxLaNhqNCV9Q","q9NskCGxFGNQwBDcsgNkY","wAdoBPUMHEFJkm6XVlHXW","sCYBuXnSNA259MDwhakmv","YgQusR9D6RbBgdkLuJuDh","ovHaNSb3tnl2LTdV7wwau","eqklm05q2g46ikqaqv9ijh9","8TJC5FfwKtfmH4GfOZVoO","9rKIOn3BV7ZU1FFlJxmvC","rsrE9vBXK0ehNkbEjltlZ","XTkKLi0Jg1imZ2lbhgOrv","4Fuw6OHQ5uhEVCUfXDfkb","pUEyedPYYlNSVLuiUSnge","KtoCw0HFEddGJ7GuW7GnN","BoxZ36iWEbUoRProxPo4D","gCmclfAHAt1tEcFDc24eD","TNhxyx7GEdGDM0PBI08b1","guyW7WWQNDGDALFV7tO57","YeEWZtb7FWvYTyJwF7zhR","DUrXQvolf76ILMKJm4Zt6","Jo4jAQcwgxsdxkcxUceR4","X6yPFUKIjs6tENQ3uNzE2","aRSv8qoJLyeE6xDAAUYpU","jwb0toyj23byc7krttp0l8k","ztqrUgUYssC0FAWDGZxWF","d7evrjgli013nul3mosquea","mvBLIZW424WZ5mCmjKQaB","YoV6c5CmpHYNEuYU4PsgH","JQzF2iPfQ2897j6HFCoY9","TicwTJD2oaTpncpPy93s2","KiGGs6PmvIlIt50r2tF2O","4TiqSFRd4hD0e5tyHbf4d","8F9H6GIButHtrFKXHzZFu","t5CaAEDQFRutGrV0ru97d","het26IMKUnKB7npru8tG4","GgRKYXklrXEAs9u15sOM9","PPvKHQNulUEvXEitqAZxM","SMGOfSTElTkJBezhNvkZ6","358nLIVsR9zmItfuBCWq2","xewZxeuhzI7qMvoYdcnLM","FAAtgk8cbuownxuv0Vlou","64N1mdh3JWL1WOv1dilYD","aCd3q2zSzgQnHKi1vOJFj","kh7Y1bQw7Om31yurE4CrW","5162x506d5mgwkn07plcuo3","LGnyEtwA1LlztJJwEpg6l","zoJRWH59vBCpqnm8fOpis","xlg9pngfxviby5z2qfcfpcv","G6zDrHf3Ua8R7vllalBc5","NrjfBxxDU92ByYSIJjgDM","zNcMG5nj1t69zkAFnvn5S","JIHQPGBUDqAEPzbhfFxlc","MmjHaByLtYx5sv2HzXnWd"],"parent":null,"data":{},"body":"\nWelcome to my Second Brain! Here you'll find thoughts, lessons, facts and any other interesting musings that I've come across or thought up over the years. A lot of what I have gathered over the years are originally from the minds of others, while some are my own. Some may be outdated and no longer reflect my current views. Some may contain misinformation, though I try to be rigorous with my additions. You can think of it as my personal wiki.\n\nThis Dendron vault is the sister component to the [Tech-focused Digital Garden](https://tech.kyletycholiz.com)\n\n### Tags\nThroughout the Second Brain, I have made use of tags, which give semantic meaning to the pieces of information.\n\n- `ex.` - Denotes an *example* of the preceding piece of information\n- `spec:` - Specifies that the preceding information has some degree of *speculation* to it, and may not be 100% factual. Ideally this gets clarified over time as my understanding develops.\n- `anal:` - Denotes an *analogy* of the preceding information. Often I will attempt to link concepts to others that I have previously learned.\n- `mn:` - Denotes a *mnemonic*\n- `expl:` - Denotes an *explanation*"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":false,"leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2,"vaultSelectionModeOnCreate":"smart"}},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"randomNote":{},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"dendronVersion":"0.83.0","vaults":[{"fsPath":"../main/thoughts-on","name":"thoughts-on"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":true,"maxPreviewsCached":10,"maxNoteLength":204800,"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"enableUserTags":true,"enableHashTags":true,"enableEditorDecorations":true,"enableFullHierarchyNoteTitle":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enableMermaid":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"Dendron","description":"The non-Tech Second Brain of Kyle Tycholiz"},"github":{"cname":"thoughts.kyletycholiz.com","enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"master","editViewMode":"tree"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","enableMermaid":true,"siteUrl":"https://thoughts.kyletycholiz.com","duplicateNoteBehavior":{"action":"useVault","payload":["thoughts-on"]},"siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}